Repository: AlvBarros/sudoku
Catalog: lib/l10n/app_*.arb
Languages: pt

source: Cancel
pt: Cancelar

source: Confirm
pt: Confirmar

# welcomeTitle
source: Welcome to
pt: Bem-vindo(a) ao

# statsGamesPlayed
source: Games played: {count}
pt: Jogos jogados: {count}

# statsPerfectGames
source: Perfect games: {count}
pt: Jogos perfeitos: {count}

# statsAverageTime
source: Average time: {time}
pt: Tempo médio: {time}

# statsNoData
source: No statistics available.
pt: Nenhum dado disponível.

# homeGameInProgress
source: Game in progress
pt: Jogo em andamento

# homeContinueGamePrompt
source: Would you like to continue your previous game?
pt: Você gostaria de continuar seu jogo anterior?

# homeButtonContinueGameButton
source: Continue game
pt: Continuar jogo

# homeStartNewGameButton
source: Start new game
pt: Iniciar novo jogo

# homeStartNewGamePrompt
source: Starting a new game will erase your current progress. Are you sure you want to continue?
pt: Iniciar um novo jogo apagará seu progresso atual. Tem certeza de que deseja continuar?

# homeSelectDifficulty
source: Select Difficulty
pt: Selecionar dificuldade

# gameIncorrectCellsAmount
source: There are {count} incorrect cells.
pt: Há {count} células incorretas.

# gameMistakesExisted
source: There are mistakes in the puzzle.
pt: Há erros no quebra-cabeça.

# gameCongratulations
source: Congratulations!
pt: Parabéns!

# gameCompletedMessage
source: You've completed the puzzle in {time}.
pt: Você completou o quebra-cabeça em {time}.

# resetTitle
source: Confirm Reset
pt: Confirmar reinício

# resetContent
source: Are you sure you want to reset the puzzle? This action cannot be undone.
pt: Tem certeza de que deseja reiniciar o quebra-cabeça? Esta ação não pode ser desfeita.

# verifyTitle
source: Lose Perfect Game?
pt: Perder jogo perfeito?

# verifyContent
source: Verifying will forfeit your chance at a perfect game. Do you want to proceed?
pt: Verificar fará com que você perca a chance de um jogo perfeito. Deseja continuar?
